Skip to main content
This is the documentation of the first stable release of COMPAS 2. If you have feedback, please give it here: COMPAS issue tracker.
  GitHub
  Discourse
  PyPI
cylinder_to_rhino_brep
 compas_rhino.conversions.cylinder_to_rhino_brep(cylinder)[source]
Convert a COMPAS cylinder to a Rhino Brep.
Parameters:
cylindercompas.geometry.Cylinder
A COMPAS cylinder.
Returns:
Rhino.Geometry.Brep
  On this page