Skip to main content
This is the documentation of the first stable release of COMPAS 2. If you have feedback, please give it here: COMPAS issue tracker.
  GitHub
  Discourse
  PyPI
line_to_rhino_curve
 compas_rhino.conversions.line_to_rhino_curve(line)[source]
Convert a COMPAS line to a Rhino curve.
Parameters:
linecompas.geometry.Line
Returns:
Rhino.Geometry.Curve
  On this page