Skip to main content
This is the documentation of the first stable release of COMPAS 2. If you have feedback, please give it here: COMPAS issue tracker.
  GitHub
  Discourse
  PyPI
ellipse_to_rhino_curve
 compas_rhino.conversions.ellipse_to_rhino_curve(ellipse)[source]
Convert a COMPAS ellipse to a Rhino curve.
Parameters:
ellipsecompas.geometry.Ellipse
Returns:
Rhino.Geometry.Curve
  On this page