line_to_rhino_curve
 compas_rhino.conversions.line_to_rhino_curve(line)[source]
Convert a COMPAS line to a Rhino curve.
Parameters
line (compas.geometry.Line)
Returns
Rhino.Geometry.Curve
Introduction
Installation
Getting started
Tutorial
API Reference
compas
compas_rhino
artists
conduits
conversions
forms
geometry
objects
utilities
compas_blender
compas_ghpython
compas_plotters
Extension points
Developer Guide
Changelog
Releases
License
Citing
COMPAS
 A computational framework for collaboration and research in Architecture, Engineering, Fabrication, and Construction.
Copyright © 2017-2021 compas-dev