ellipse_to_rhino_curve
 compas_rhino.conversions.ellipse_to_rhino_curve(ellipse)[source]
Convert a COMPAS ellipse to a Rhino curve.
Parameters
ellipse (compas.geometry.Ellipse)
Returns
Rhino.Geometry.Curve
Introduction
Installation
Getting started
Tutorial
API Reference
compas
compas_rhino
artists
conduits
conversions
forms
geometry
objects
utilities
compas_blender
compas_ghpython
compas_plotters
Extension points
Developer Guide
Changelog
Releases
License
Citing
COMPAS
 A computational framework for collaboration and research in Architecture, Engineering, Fabrication, and Construction.
Copyright © 2017-2021 compas-dev