Skip to main content
This is the WIP documentation for the pre-release of COMPAS 2.0. The documentation of COMPAS 1.17.5 is available here.
  GitHub
  Discourse
  PyPI
capsule_to_rhino_brep
 compas_rhino.conversions.capsule_to_rhino_brep(capsule)
Convert a COMPAS capsule to a Rhino Brep.
Parameters
capsuleCapsule
A COMPAS capsule.
Returns
list[Rhino.Geometry.Brep]
   Edit on GitHub