Skip to main content
This is the documentation for the pre-release of COMPAS 2.0. The documentation of the stable release of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
frame_to_rhino_plane
 compas_rhino.conversions.frame_to_rhino_plane(frame)[source]
Convert a COMPAS frame to a Rhino plane.
Parameters:
framecompas.geometry.Frame
Returns:
Rhino.Geometry.Plane
  On this page