Skip to main content
This is the documentation for the pre-release of COMPAS 2.0. The documentation of the stable release of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
capsule_to_rhino_brep
 compas_rhino.conversions.capsule_to_rhino_brep(capsule)[source]
Convert a COMPAS capsule to a Rhino Brep.
Parameters:
capsulecompas.geometry.Capsule
A COMPAS capsule.
Returns:
list[Rhino.Geometry.Brep]
  On this page