Skip to main content
This is the documentation for the pre-release of COMPAS 2.0. The documentation of the stable release of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
polyline_to_rhino_curve
 compas_rhino.conversions.polyline_to_rhino_curve(polyline)[source]
Convert a COMPAS polyline to a Rhino curve.
Parameters:
polylinecompas.geometry.Polyline
Returns:
Rhino.Geometry.PolylineCurve
  On this page