Skip to main content
This is the documentation for the pre-release of COMPAS 2.0. The documentation of the stable release of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
cylinder_to_rhino_brep
 compas_rhino.conversions.cylinder_to_rhino_brep(cylinder)[source]
Convert a COMPAS cylinder to a Rhino Brep.
Parameters:
cylindercompas.geometry.Cylinder
A COMPAS cylinder.
Returns:
Rhino.Geometry.Brep
  On this page