Skip to main content
This is the WIP documentation for the pre-release of COMPAS 2.0. The documentation of COMPAS 1.17.6 is available here.
  GitHub
  Discourse
  PyPI
ellipse_to_rhino_curve
 compas_rhino.conversions.ellipse_to_rhino_curve(ellipse)
Convert a COMPAS ellipse to a Rhino curve.
Parameters
ellipseEllipse
Returns
Rhino.Geometry.Curve
   Edit on GitHub