Skip to main content
This is the WIP documentation for the pre-release of COMPAS 2.0. The documentation of COMPAS 1.17.6 is available here.
  GitHub
  Discourse
  PyPI
frame_to_rhino_plane
 compas_rhino.conversions.frame_to_rhino_plane(frame)
Convert a COMPAS frame to a Rhino plane.
Parameters
frameFrame
Returns
Rhino.Geometry.Plane
   Edit on GitHub