circle_to_rhino_curve
 compas_rhino.conversions.circle_to_rhino_curve(circle)[source]
Convert a COMPAS circle to a Rhino curve.
Parameters
circle (compas.geometry.Circle)
Returns
Rhino.Geometry.Curve
Introduction
Installation
Getting started
Tutorial
API Reference
compas
compas_rhino
artists
conduits
conversions
forms
geometry
objects
utilities
compas_blender
compas_ghpython
compas_plotters
Extension points
Developer Guide
Changelog
Releases
License
Citing
COMPAS
 A computational framework for collaboration and research in Architecture, Engineering, Fabrication, and Construction.
Copyright © 2017-2021 compas-dev