frame_to_rhino_plane
 compas_rhino.conversions.frame_to_rhino_plane(frame)[source]
Convert a COMPAS frame to a Rhino plane.
Parameters
frame (Frame)
Returns
Rhino.Geometry.Plane
Introduction
Installation
Getting started
Tutorial
API Reference
compas
compas_blender
compas_ghpython
compas_plotters
compas_rhino
artists
conduits
conversions
forms
geometry
utilities
Extension points
Developer Guide
Changelog
Releases
License
Citing
COMPAS
 A computational framework for collaboration and research in Architecture, Engineering, Fabrication, and Construction.
Copyright © 2017-2021 compas-dev