Skip to main content
  GitHub
  Discourse
  PyPI
frame_to_rhino_plane
 compas_rhino.conversions.frame_to_rhino_plane(frame)[source]
Convert a COMPAS frame to a Rhino plane.
Parameters:
framecompas.geometry.Frame
Returns:
Rhino.Geometry.Plane
  On this page