Skip to main content
This is the documentation of the first stable release of COMPAS 2. If you have feedback, please give it here: COMPAS issue tracker.
  GitHub
  Discourse
  PyPI
data_to_rhino_surface
 compas_rhino.conversions.data_to_rhino_surface(data)[source]
Convert a COMPAS surface to a Rhino surface.
Parameters:
data: dict
Returns:
Rhino.Geometry.NurbsSurface
  On this page