Skip to main content
  GitHub
  Discourse
  PyPI
capsule_to_rhino_brep
 compas_rhino.conversions.capsule_to_rhino_brep(capsule)[source]
Convert a COMPAS capsule to a Rhino Brep.
Parameters:
capsulecompas.geometry.Capsule
A COMPAS capsule.
Returns:
list[Rhino.Geometry.Brep]
  On this page