Skip to main content
  GitHub
  Discourse
  PyPI
cone_to_rhino_brep
 compas_rhino.conversions.cone_to_rhino_brep(cone)[source]
Convert a COMPAS cone to a Rhino Brep.
Parameters:
conecompas.geometry.Cone
A COMPAS cone.
Returns:
Rhino.Geometry.Brep
  On this page