Skip to main content
  GitHub
  Discourse
  PyPI
ellipse_to_rhino_curve
 compas_rhino.conversions.ellipse_to_rhino_curve(ellipse)[source]
Convert a COMPAS ellipse to a Rhino curve.
Parameters:
ellipsecompas.geometry.Ellipse
Returns:
Rhino.Geometry.Curve
  On this page