Skip to main content
  GitHub
  Discourse
  PyPI
line_to_rhino_curve
 compas_rhino.conversions.line_to_rhino_curve(line)[source]
Convert a COMPAS line to a Rhino curve.
Parameters:
linecompas.geometry.Line
Returns:
Rhino.Geometry.Curve
  On this page