Skip to main content
This is the documentation of the first stable release of COMPAS 2. If you have feedback, please give it here: COMPAS issue tracker.
  GitHub
  Discourse
  PyPI
cone_to_rhino_brep
 compas_rhino.conversions.cone_to_rhino_brep(cone)[source]
Convert a COMPAS cone to a Rhino Brep.
Parameters:
conecompas.geometry.Cone
A COMPAS cone.
Returns:
Rhino.Geometry.Brep
  On this page