Skip to main content
This is the WIP documentation for the pre-release of COMPAS 2.0. The documentation of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
circle_to_rhino_curve
 compas_rhino.conversions.circle_to_rhino_curve(circle)[source][source]
Convert a COMPAS circle to a Rhino curve.
Parameters
circlecompas.geometry.Circle
Returns
Rhino.Geometry.Curve
   Edit on GitHub