Skip to main content
This is the WIP documentation for the pre-release of COMPAS 2.0. The documentation of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
cone_to_rhino_brep
 compas_rhino.conversions.cone_to_rhino_brep(cone)[source][source]
Convert a COMPAS cone to a Rhino Brep.
Parameters
conecompas.geometry.Cone
A COMPAS cone.
Returns
Rhino.Geometry.Brep
   Edit on GitHub