Skip to main content
This is the WIP documentation for the pre-release of COMPAS 2.0. The documentation of COMPAS 1.17.6 is available here.
  GitHub
  Discourse
  PyPI
torus_to_rhino_brep
 compas_rhino.conversions.torus_to_rhino_brep(torus)
Convert a COMPAS torus to a Rhino Brep.
Parameters
torusTorus
A COMPAS torus.
Returns
Rhino.Geometry.Brep
The Rhino brep representation.
   Edit on GitHub