Skip to main content
This is the WIP documentation for the pre-release of COMPAS 2.0. The documentation of COMPAS 1.17.6 is available here.
  GitHub
  Discourse
  PyPI
line_to_rhino_curve
 compas_rhino.conversions.line_to_rhino_curve(line)
Convert a COMPAS line to a Rhino curve.
Parameters
lineLine
Returns
Rhino.Geometry.Curve
   Edit on GitHub