Skip to main content
This is the WIP documentation for the pre-release of COMPAS 2.0. The documentation of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
ellipse_to_rhino_curve
 compas_rhino.conversions.ellipse_to_rhino_curve(ellipse)[source][source]
Convert a COMPAS ellipse to a Rhino curve.
Parameters
ellipsecompas.geometry.Ellipse
Returns
Rhino.Geometry.Curve
   Edit on GitHub