Skip to main content
This is the WIP documentation for the pre-release of COMPAS 2.0. The documentation of COMPAS 1.17.6 is available here.
  GitHub
  Discourse
  PyPI
polyline_to_rhino_curve
 compas_rhino.conversions.polyline_to_rhino_curve(polyline)
Convert a COMPAS polyline to a Rhino curve.
Parameters
polylinePolyline
Returns
Rhino.Geometry.PolylineCurve
   Edit on GitHub