Skip to main content
This is the WIP documentation for the pre-release of COMPAS 2.0. The documentation of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
cylinder_to_rhino_brep
 compas_rhino.conversions.cylinder_to_rhino_brep(cylinder)
Convert a COMPAS cylinder to a Rhino Brep.
Parameters
cylinderCylinder
A COMPAS cylinder.
Returns
Rhino.Geometry.Brep
   Edit on GitHub