Skip to main content
This is the documentation for the pre-release of COMPAS 2.0. The documentation of the stable release of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
data_to_rhino_surface
 compas_rhino.conversions.data_to_rhino_surface(data)[source]
Convert a COMPAS surface to a Rhino surface.
Parameters:
data: dict
Returns:
Rhino.Geometry.NurbsSurface
  On this page