Skip to main content
This is the documentation of the first stable release of COMPAS 2. If you have feedback, please give it here: COMPAS issue tracker.
  GitHub
  Discourse
  PyPI
torus_to_rhino_brep
 compas_rhino.conversions.torus_to_rhino_brep(torus)[source]
Convert a COMPAS torus to a Rhino Brep.
Parameters:
toruscompas.geometry.Torus
A COMPAS torus.
Returns:
Rhino.Geometry.Brep
The Rhino brep representation.
  On this page