Skip to main content
This is the WIP documentation for the pre-release of COMPAS 2.0. The documentation of COMPAS 1.17.5 is available here.
  GitHub
  Discourse
  PyPI
circle_to_rhino_curve
 compas_rhino.conversions.circle_to_rhino_curve(circle)
Convert a COMPAS circle to a Rhino curve.
Parameters
circleCircle
Returns
Rhino.Geometry.Curve
   Edit on GitHub