Skip to main content
This is the documentation for the pre-release of COMPAS 2.0. The documentation of the stable release of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
circle_to_rhino_curve
 compas_rhino.conversions.circle_to_rhino_curve(circle)[source]
Convert a COMPAS circle to a Rhino curve.
Parameters:
circlecompas.geometry.Circle
Returns:
Rhino.Geometry.Curve
  On this page