Skip to main content
This is the documentation for the pre-release of COMPAS 2.0. The documentation of the stable release of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
line_to_rhino_curve
 compas_rhino.conversions.line_to_rhino_curve(line)[source]
Convert a COMPAS line to a Rhino curve.
Parameters:
linecompas.geometry.Line
Returns:
Rhino.Geometry.Curve
  On this page