Skip to main content
This is the documentation for the pre-release of COMPAS 2.0. The documentation of the stable release of COMPAS 1.x is available here.
  GitHub
  Discourse
  PyPI
torus_to_rhino_brep
 compas_rhino.conversions.torus_to_rhino_brep(torus)[source]
Convert a COMPAS torus to a Rhino Brep.
Parameters:
toruscompas.geometry.Torus
A COMPAS torus.
Returns:
Rhino.Geometry.Brep
The Rhino brep representation.
  On this page