Skip to main content
This is the documentation of the first stable release of COMPAS 2. If you have feedback, please give it here: COMPAS issue tracker.
  GitHub
  Discourse
  PyPI
polyline_to_rhino_curve
 compas_rhino.conversions.polyline_to_rhino_curve(polyline)[source]
Convert a COMPAS polyline to a Rhino curve.
Parameters:
polylinecompas.geometry.Polyline
Returns:
Rhino.Geometry.PolylineCurve
  On this page