Skip to main content
This is the documentation of the first stable release of COMPAS 2. If you have feedback, please give it here: COMPAS issue tracker.
  GitHub
  Discourse
  PyPI
capsule_to_rhino_brep
 compas_rhino.conversions.capsule_to_rhino_brep(capsule)[source]
Convert a COMPAS capsule to a Rhino Brep.
Parameters:
capsulecompas.geometry.Capsule
A COMPAS capsule.
Returns:
list[Rhino.Geometry.Brep]
  On this page