Skip to main content
This is the documentation of the first stable release of COMPAS 2. If you have feedback, please give it here: COMPAS issue tracker.
  GitHub
  Discourse
  PyPI
circle_to_rhino_curve
 compas_rhino.conversions.circle_to_rhino_curve(circle)[source]
Convert a COMPAS circle to a Rhino curve.
Parameters:
circlecompas.geometry.Circle
Returns:
Rhino.Geometry.Curve
  On this page